# World Development Indicator Dashboard
World Development Indicators (WDI) is the World Bank’s premier compilation of cross-country comparable data on development.
This notebook prepares the data for producing interactive visualizations.

**References**
- http://wdi.worldbank.org/
- https://wbdata.readthedocs.io/en/stable/
- https://datahelpdesk.worldbank.org/knowledgebase/topics/125589-developer-information
- https://databank.worldbank.org/source/world-development-indicators

**Data Source**
- https://datacatalog.worldbank.org/dataset/world-development-indicators
- https://unstats.un.org/unsd/methodology/m49/overview

In [1]:
import pandas as pd

## Step 1 - Process WDI Data

**1.1 Load the data**

In [13]:
df_wdi = pd.read_csv("../data/WDIData.csv")
df_wdi.shape

(380160, 66)

In [14]:
df_wdi.sample(2)

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2012,2013,2014,2015,2016,2017,2018,2019,2020,Unnamed: 65
335280,Sudan,SDN,"School enrollment, preprimary, female (% gross)",SE.PRE.ENRR.FE,NaN,NaN,NaN,NaN,NaN,NaN,...,37.04562,49.123241,44.811131,44.528858,46.180439,47.098412,NaN,NaN,NaN,NaN
317508,Slovak Republic,SVK,"Literacy rate, youth (ages 15-24), gender pari...",SE.ADT.1524.LT.FM.ZS,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

**1.2 Drop the last column (unuseful)**

In [15]:
df_wdi.drop(columns=df_wdi.columns[-1], inplace=True)
df_wdi.sample(1)

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
130726,Comoros,COM,"Primary education, teachers (% female)",SE.PRM.TCHR.FE.ZS,NaN,NaN,NaN,NaN,NaN,NaN,...,27.8029,NaN,42.73484,NaN,NaN,NaN,20.314199,29.494129,NaN,NaN

**1.3 Display the first five indicator code/name pair**

In [24]:
df_indicators = df_wdi[["Indicator Code", "Indicator Name"]].drop_duplicates()
df_indicators.shape

(1440, 2)

In [25]:
df_indicators.sample(2)

,Indicator Code,Indicator Name
840,DC.DAC.SVNL.CD,"Net bilateral aid flows from DAC donors, Slove..."
13,per_si_allsi.adq_pop_tot,Adequacy of social insurance programs (% of to...

**1.4 Save the indicator code/name pair to a file**

In [26]:
df_indicator.to_csv("../data/indicators.csv", index=False)

**1.5 Drop the indicator name column from the WDI data frame**

This is to save memory

In [28]:
df_wdi = df_wdi.drop(columns=["Indicator Name"])
df_wdi.sample()

,Country Name,Country Code,Indicator Code,1960,1961,1962,1963,1964,1965,1966,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
177972,Greece,GRC,DT.NFL.MIBR.CD,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## Step 2 - Process Country, Region, Sub-region Data

**2.1 Read the data**

In [7]:
df_country = pd.read_csv("../data/country_regions.csv")
df_country.head(2)

,Global Code,Global Name,Region Code,Region Name,Sub-region Code,Sub-region Name,Intermediate Region Code,Intermediate Region Name,Country or Area,M49 Code,ISO-alpha2 Code,ISO-alpha3 Code,Least Developed Countries (LDC),Land Locked Developing Countries (LLDC),Small Island Developing States (SIDS),Developed / Developing Countries
0,1,World,2.0,Africa,15.0,Northern Africa,NaN,NaN,Algeria,12,DZ,DZA,NaN,NaN,NaN,Developing
1,1,World,2.0,Africa,15.0,Northern Africa,NaN,NaN,Egypt,818,EG,EGY,NaN,NaN,NaN,Developing

**2.2 Select the columns of interest**

In [29]:
df_regions = df_country[["ISO-alpha3 Code", "Region Name", "Sub-region Name"]]
df_regions.sample(2)

    ISO-alpha3 Code Region Name  Sub-region Name
202             ITA      Europe  Southern Europe
226             FJI     Oceania        Melanesia

## Step 3. Merge the Two Data Frames

In [30]:
df_merged= pd.merge(df_regions, 
                    df_wdi,
                    right_on=["Country Code"],
                    left_on=["ISO-alpha3 Code"],
                    how="right"
)

df_merged.sample(2)

,ISO-alpha3 Code,Region Name,Sub-region Name,Country Name,Country Code,Indicator Code,1960,1961,1962,1963,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
5330,NaN,NaN,NaN,Early-demographic dividend,EAR,SP.POP.1014.MA.5Y,10.756839,10.932629,11.172502,11.449656,...,10.361776,10.254158,10.148133,10.044014,9.94175,9.836106,9.734442,9.635956,9.538834,NaN
286517,PAN,Americas,Latin America and the Caribbean,Panama,PAN,SL.UEM.TOTL.MA.NE.ZS,NaN,NaN,NaN,NaN,...,2.079800,1.973700,1.805800,2.203600,2.38590,2.898900,3.083500,3.134800,3.971500,NaN

In [39]:
df_merged.shape

(380160, 66)

**Drop the redundant column**

In [31]:
df_merged.drop(columns=["ISO-alpha3 Code"], inplace=True)
df_merged.sample(2)

,Region Name,Sub-region Name,Country Name,Country Code,Indicator Code,1960,1961,1962,1963,1964,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
22960,NaN,NaN,IBRD only,IBD,SE.SEC.TCAQ.LO.FE.ZS,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,85.186234,85.574303,NaN
138968,Americas,Latin America and the Caribbean,Cuba,CUB,TX.VAL.MANF.ZS.UN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

**Drop the rows without a proper region or sub-region**

In [45]:
df_merged = df_merged[df_merged["Sub-region Name"].notnull()]
df_merged = df_merged[df_merged["Region Name"].notnull()]
df_merged.shape

(306720, 66)

## Step 4 - Melt and save the dataframe for easy analysis

**4.1 Melt the dataframe**

From the long form to the short form (like melting an iceburg)

In [46]:
df_melted = df_merged.melt(id_vars=df_merged.columns[:5], 
                          value_vars=df_merged.columns[5:], 
                          var_name="Year", 
                          value_name='Indicator Value')

df_melted.sample()

,Region Name,Sub-region Name,Country Name,Country Code,Indicator Code,Year,Indicator Value
6346424,Americas,Latin America and the Caribbean,Panama,PAN,SE.TER.CUAT.DO.FE.ZS,1980,NaN

In [47]:
df_melted.shape

(18709920, 7)

**Only keep the rows with indicator value**

In [50]:
df_melted = df_melted[df_melted["Indicator Value"].notnull()]
df_melted.shape

(6135937, 7)

In [52]:
df_melted.sample(2)

,Region Name,Sub-region Name,Country Name,Country Code,Indicator Code,Year,Indicator Value
8760650,Europe,Southern Europe,Malta,MLT,SE.PRM.AGES,1988,5.0
17084060,Oceania,Melanesia,Papua New Guinea,PNG,SH.ALC.PCAP.MA.LI,2015,2.3

**4.2 Save the melted dataframe to a file**

In [53]:
df_melted.to_csv("../data/world_dev_indicators.csv", index=False)